AIM : To study and apply data preproceessing technique on given dataset

Problem Statement : Prepare a titanic and heart disease dataset for training with machine learning algorithm by applying suitable data processing techniques 

tasks :
1. Perform basic eda using fucntions like head, tail, describe, shape
2. Identify and handle missing values 
3. Check for duplicates and handle it
4. Apply data encoding technique on suitable attribute
5. Apply Multivariate, Bivariate and Univariate Analysis
6. Split the dataset in 80:20 ratio for training and testing

In [12]:
import pandas as pd
df =  pd.read_excel('titanic.xlsx')
print(df)

     PassengerId  Survived  Pclass  \
0            1.0       0.0     3.0
1            2.0       1.0     1.0
2            3.0       1.0     3.0
3            4.0       1.0     1.0
4            5.0       0.0     3.0
..           ...       ...     ...
886        887.0       0.0     2.0
887        888.0       1.0     1.0
888        889.0       0.0     3.0
889        890.0       1.0     1.0
890        891.0       0.0     3.0

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0    1.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0    1.0
2                               Heikkinen, Miss. Laina  female  26.0    0.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0    1.0
4                             Allen, Mr. William Henry    male  35.0    0.0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0    0.0
887                       Graham, Miss. Margaret Edith  female  19.0    0.0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN    1.0
889                              Behr, Mr. Karl Howell    male  26.0    0.0
890                                Dooley, Mr. Patrick    male  32.0    0.0

     Parch            Ticket     Fare Cabin Embarked
0      0.0         A/5 21171   7.2500   NaN        S
1      0.0          PC 17599  71.2833   C85        C
2      0.0  STON/O2. 3101282   7.9250   NaN        S
3      0.0          113803.0  53.1000  C123        S
4      0.0          373450.0   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886    0.0          211536.0  13.0000   NaN        S
887    0.0          112053.0  30.0000   B42        S
888    2.0        W./C. 6607  23.4500   NaN        S
889    0.0          111369.0  30.0000  C148        C
890    0.0          370376.0   7.7500   NaN        Q

[891 rows x 12 columns]

In [13]:
df.dtypes

PassengerId    float64
Survived       float64
Pclass         float64
Name            object
Sex             object
Age            float64
SibSp          float64
Parch          float64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    float64
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    float64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    float64
 7   Parch        891 non-null    float64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(7), object(5)
memory usage: 83.7+ KB

In [15]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [21]:
#df.drop(['PassengerId'],axis=1,inplace=True)

In [19]:
df.drop(['Name'],axis=1,inplace=True)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    float64
 1   Pclass    891 non-null    float64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    float64
 5   Parch     891 non-null    float64
 6   Ticket    891 non-null    object
 7   Fare      891 non-null    float64
 8   Cabin     204 non-null    object
 9   Embarked  889 non-null    object
dtypes: float64(6), object(4)
memory usage: 69.7+ KB

In [23]:
df.drop(['SibSp'],axis=1,inplace=True)
df.drop(['Parch'],axis=1,inplace=True)
df.drop(['Ticket'],axis=1,inplace=True)
df.drop(['Embarked'],axis=1,inplace=True)

In [24]:
df

     Survived  Pclass     Sex   Age     Fare Cabin
0         0.0     3.0    male  22.0   7.2500   NaN
1         1.0     1.0  female  38.0  71.2833   C85
2         1.0     3.0  female  26.0   7.9250   NaN
3         1.0     1.0  female  35.0  53.1000  C123
4         0.0     3.0    male  35.0   8.0500   NaN
..        ...     ...     ...   ...      ...   ...
886       0.0     2.0    male  27.0  13.0000   NaN
887       1.0     1.0  female  19.0  30.0000   B42
888       0.0     3.0  female   NaN  23.4500   NaN
889       1.0     1.0    male  26.0  30.0000  C148
890       0.0     3.0    male  32.0   7.7500   NaN

[891 rows x 6 columns]

In [25]:
df.drop(['Cabin'],axis=1,inplace=True)

In [26]:
df

     Survived  Pclass     Sex   Age     Fare
0         0.0     3.0    male  22.0   7.2500
1         1.0     1.0  female  38.0  71.2833
2         1.0     3.0  female  26.0   7.9250
3         1.0     1.0  female  35.0  53.1000
4         0.0     3.0    male  35.0   8.0500
..        ...     ...     ...   ...      ...
886       0.0     2.0    male  27.0  13.0000
887       1.0     1.0  female  19.0  30.0000
888       0.0     3.0  female   NaN  23.4500
889       1.0     1.0    male  26.0  30.0000
890       0.0     3.0    male  32.0   7.7500

[891 rows x 5 columns]

In [28]:
#dependent variables
#survival is dependent on the passenger data hence survival is dependent and other cvolumns like age, gender are independent
target = df.Survived
target

0      0.0
1      1.0
2      1.0
3      1.0
4      0.0
      ...
886    0.0
887    1.0
888    0.0
889    1.0
890    0.0
Name: Survived, Length: 891, dtype: float64

In [29]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0       0.0     3.0    male  22.0   7.2500
1       1.0     1.0  female  38.0  71.2833
2       1.0     3.0  female  26.0   7.9250
3       1.0     1.0  female  35.0  53.1000
4       0.0     3.0    male  35.0   8.0500

In [77]:
data = df.copy()
data.drop(['Survived'],axis=1,inplace=True)
print(data)

     Pclass     Sex   Age     Fare
0       3.0    male  22.0   7.2500
1       1.0  female  38.0  71.2833
2       3.0  female  26.0   7.9250
3       1.0  female  35.0  53.1000
4       3.0    male  35.0   8.0500
..      ...     ...   ...      ...
886     2.0    male  27.0  13.0000
887     1.0  female  19.0  30.0000
888     3.0  female   NaN  23.4500
889     1.0    male  26.0  30.0000
890     3.0    male  32.0   7.7500

[891 rows x 4 columns]

In [78]:
data

     Pclass     Sex   Age     Fare
0       3.0    male  22.0   7.2500
1       1.0  female  38.0  71.2833
2       3.0  female  26.0   7.9250
3       1.0  female  35.0  53.1000
4       3.0    male  35.0   8.0500
..      ...     ...   ...      ...
886     2.0    male  27.0  13.0000
887     1.0  female  19.0  30.0000
888     3.0  female   NaN  23.4500
889     1.0    male  26.0  30.0000
890     3.0    male  32.0   7.7500

[891 rows x 4 columns]

In [79]:
data.isnull()

     Pclass    Sex    Age   Fare
0     False  False  False  False
1     False  False  False  False
2     False  False  False  False
3     False  False  False  False
4     False  False  False  False
..      ...    ...    ...    ...
886   False  False  False  False
887   False  False  False  False
888   False  False   True  False
889   False  False  False  False
890   False  False  False  False

[891 rows x 4 columns]

In [80]:
data.isnull().sum()

Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64

In [81]:
target.isnull().sum()

0

In [82]:
data.Age.mean()

29.69911764705882

In [83]:
data['Age'].mode()

0    24.0
dtype: float64

In [84]:
data['Age'].median()

28.0

In [85]:
data['Age'].fillna(data.Age.mean(),inplace=True)

In [86]:
data.isnull().sum()

Pclass    0
Sex       0
Age       0
Fare      0
dtype: int64

In [87]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    float64
 1   Sex     891 non-null    object
 2   Age     891 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(3), object(1)
memory usage: 28.0+ KB

In [88]:
data

     Pclass     Sex        Age     Fare
0       3.0    male  22.000000   7.2500
1       1.0  female  38.000000  71.2833
2       3.0  female  26.000000   7.9250
3       1.0  female  35.000000  53.1000
4       3.0    male  35.000000   8.0500
..      ...     ...        ...      ...
886     2.0    male  27.000000  13.0000
887     1.0  female  19.000000  30.0000
888     3.0  female  29.699118  23.4500
889     1.0    male  26.000000  30.0000
890     3.0    male  32.000000   7.7500

[891 rows x 4 columns]

In [89]:
data['Sex'] = data['Sex'].replace(['male', 'female','other'],[0, 1, 2])

In [90]:
data

     Pclass  Sex        Age     Fare
0       3.0    0  22.000000   7.2500
1       1.0    1  38.000000  71.2833
2       3.0    1  26.000000   7.9250
3       1.0    1  35.000000  53.1000
4       3.0    0  35.000000   8.0500
..      ...  ...        ...      ...
886     2.0    0  27.000000  13.0000
887     1.0    1  19.000000  30.0000
888     3.0    1  29.699118  23.4500
889     1.0    0  26.000000  30.0000
890     3.0    0  32.000000   7.7500

[891 rows x 4 columns]

In [91]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    float64
 1   Sex     891 non-null    int64
 2   Age     891 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(3), int64(1)
memory usage: 28.0 KB

In [93]:
data.shape  #independent

(891, 4)

In [95]:
target.shape #dependent

(891,)

In [97]:
from sklearn.model_selection import train_test_split

In [103]:
X_train,X_test,y_train,y_test = train_test_split(data,target,test_size=0.2) #spiltted into 20:80 ratio

In [104]:
len(X_train)

712

In [105]:
len(X_test)

179

In [106]:
len(y_train)

712

In [107]:
len(y_test)

179

In [ ]:
#decision tree Classifier

In [108]:
from sklearn import tree

In [109]:
model = tree.DecisionTreeClassifier()

In [110]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [112]:
model.score(X_test,y_test) #score testing ka rehta hai

0.7877094972067039

In [118]:
model.predict([[3.0,0,22.000000,7.2500]]) #to predict

array([0.])

In [115]:
data

     Pclass  Sex        Age     Fare
0       3.0    0  22.000000   7.2500
1       1.0    1  38.000000  71.2833
2       3.0    1  26.000000   7.9250
3       1.0    1  35.000000  53.1000
4       3.0    0  35.000000   8.0500
..      ...  ...        ...      ...
886     2.0    0  27.000000  13.0000
887     1.0    1  19.000000  30.0000
888     3.0    1  29.699118  23.4500
889     1.0    0  26.000000  30.0000
890     3.0    0  32.000000   7.7500

[891 rows x 4 columns]

In [116]:
model.predict([[1,1,38,71.2833]])

array([1.])

In [117]:
model.predict([[1,1,38,71]])

array([1.])

In [119]:
model.predict([[3.0,0,35.000000,8.0500]])

array([0.])

In [120]:
data.to_csv("independent_variable_titanic.csv")

In [121]:
target.to_csv("dependent_variable_titanic.csv")